from random import choice
from sys import exit

right_answers = ['Верно!', 'Отлично!', 'Так держать!', 'Прямо в точку', 'Угадал!']
wrong_answers = ['Мимо', 'Не верно', 'Не угадал', 'Не-а', 'Не то']
rus_alpha = 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
words = ['человек', 'работа', 'вопрос', 'сторона', 'страна', 'случай', 'голова',
         'ребенок', 'система', 'отношение', 'женщина', 'деньги', 'машина', 'проблема',
         'решение', 'история', 'власть', 'тысяча', 'возможность', 'результат',
         'область', 'статья', 'компания', 'группа', 'развитие', 'процесс', 'условие',
         'средство', 'начало', 'уровень', 'минута', 'качество', 'дорога', 'действие',
         'государство', 'любовь', 'взгляд', 'общество', 'деятельность', 'организация',
         'президент', 'комната', 'порядок', 'момент', 'письмо', 'помощь', 'ситуация',
         'состояние', 'квартира', 'внимание', 'смерть', 'программа', 'задача',
         'предприятие', 'разговор', 'правительство', 'производство', 'информация',
         'положение', 'интерес', 'федерация', 'правило', 'управление', 'мужчина',
         'партия', 'сердце', 'движение', 'материал', 'неделя', 'чувство', 'газета',
         'причина', 'основа', 'товарищ', 'культура', 'данные', 'мнение', 'документ',
         'институт', 'проект', 'встреча', 'директор', 'служба', 'судьба', 'девушка',
         'очередь', 'состав', 'количество', 'событие', 'объект', 'создание', 'значение',
         'период', 'искусство', 'структура', 'пример', 'исследование', 'гражданин',
         'начальник', 'принцип', 'воздух', 'характер', 'борьба', 'использование',
         'размер', 'образование', 'мальчик', 'представитель', 'участие', 'девочка',
         'политика', 'картина', 'доллар', 'территория', 'изменение', 'направление',
         'рисунок', 'течение', 'церковь', 'население', 'большинство', 'музыка',
         'правда', 'свобода', 'память', 'команда', 'договор', 'дерево', 'хозяин',
         'природа', 'телефон', 'позиция', 'писатель', 'самолет', 'солнце', 'спектакль',
         'способ', 'журнал', 'руководитель', 'специалист', 'оценка', 'регион', 'процент',
         'родитель', 'требование', 'основание', 'половина', 'анализ', 'автомобиль',
         'экономика', 'литература', 'бумага', 'степень', 'господин', 'надежда',
         'предмет', 'руководство', 'площадь', 'режиссер', 'поверхность', 'ощущение',
         'станция', 'революция', 'колено', 'министерство', 'стекло']

prints = [
'''
_____
|   
| 
| 
| 
|
-------''',
'''
_____
|   | 
| 
| 
| 
|
-------''',
'''
_____
|   | 
|   O 
| 
| 
|
-------''',
'''
_____
|   | 
|   O 
|   | 
| 
|
-------''',
'''
_____
|   | 
|   O 
|  /| 
| 
|
-------''',
'''
_____
|   | 
|   O 
|  /|\\ 
| 
|
-------''',
'''
_____
|   | 
|   O 
|  /|\\ 
|  / 
|
-------''',
'''
_____
|   | 
|   O 
|  /|\\ 
|  / \\ 
|
-------''']

print('\nЭто игра "Виселица"!')
print('Угадывай буквы в слове, которое загадает программа')
print('У тебя есть право только на 7 ошибок, иначе человечка повесят :(')

def game_repeat():
    repeat = input('''\nНажми "1", если хочешь сыграть снова
Или "2", если хочешь завершить программу\n\n''')
    while repeat != "1" and repeat != "2":
        repeat = input('''\nНеверное значение
Нажми "1", если хочешь сыграть снова
Или "2", если хочешь завершить программу\n\n''')
    if repeat == "1":
        game()
    else:
        exit()

def game():
    word = choice(words).upper()
    new_word = ['_' for i in range(len(word))]
    new_word[0] = word[0]
    new_word[-1] = word[-1]
    it_was = []
    count = 0
    print('\nТвое слово на этот раз такое:')
    print(*new_word)
    print(len(word), 'букв')

    while count != 8:
        alpha = input('\nВведи одну любую букву русского алфавита\n\n').upper()

        while alpha.isalpha() == False or alpha not in rus_alpha or len(alpha) != 1 or alpha in it_was:
            if len(alpha) != 1:
                alpha = input('''\nНужна только одна буква\n\n''').upper()
            elif alpha.isalpha() == False:
                alpha = input('''\nДопускаются только буквы.\n\n''').upper()
            elif alpha not in rus_alpha:
                alpha = input('''\nНужна буква русского алфавита\n\n''').upper()
            elif alpha in it_was:
                alpha = input('''\nТы уже вводил эту букву\n\n''').upper()

        it_was.append(alpha)

        for j in range(len(word)):
            if alpha == word[j]:
                new_word[j] = alpha

        if '_' not in new_word:
            print('\nПобеда! Искомое слово:', word.upper())
            words.remove(word.lower())
            game_repeat()

        if alpha in word[1:-1]:
            print(f'\n{choice(right_answers)}')
            print('Вот так сейчас выглядит твое слово')
            print(*new_word, sep =' ')

        else:
            print(prints[count], end = '')
            print('   ', choice(wrong_answers))
            count += 1

    print('\nВсе попытки потрачены. Человечек повешен')
    print('Искомое слово было:', word)
    words.remove(word.lower())
    game_repeat()

game()