#Вызов модулей
from random import choice, randint
from time import sleep

#Пауза
def pause(sec):
    sleep(sec)

#Скрипты ответов
answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом', 'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']
questions_repeat = ['Может быть что-то еще?', 'Продолжаем?', 'Могу ответить снова', 'Давай еще парочку?', 'Твой следующий вопрос?']
waiting = ['Жду ответа от Вселенной...', 'Посылаю запрос в космос...', 'Звёзды просят немного подождать...', 'Дайте подумать...', 'Получаю ваш ответ...']

#Приветствие
print('Привет! Это игра "Шар судьбы"!\n')
pause(1.5)
name = input('Назови свое имя\n\n')
pause(1.5)
print(f'\nЗадай мне любой вопрос, {name}!\n')
pause(1.5)
print('О прошлом, о будущем, или о настоящем\n')
pause(1.5)
print('И получи свой судьбоносный ответ! :0\n')

#Первый ответ
def first_game():
    answer = input()
    pause(1.5)
    print(f'\n{choice(waiting)}')
    pause(5)
    print(f'\n{choice(answers)}')
    pause(1.5)

first_game()

#Последующие ответы
def game_repeat():
    answer = input(f'\n{choice(questions_repeat)}\n\n')
    pause(1.5)
    print(f'\n{choice(waiting)}')
    pause(5)
    print(f'\n{choice(answers)}')
    pause(1.5)
    game_repeat()

game_repeat()